import React from 'react';
import style from './terms.module.css';

export const Terms = () => (
  <section className={style.terms}>
    <h1 className={style.terms__title}>Правила пользования</h1>
    <ol className={style.terms__rule}>
      <li className={style.rule__firstLevel}>
        Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет собой
        интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.
        <ol>
          <li className={style.rule__secondLevel}>
            Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
            участника как способного принимать собственные решения касаемо инновационных методов управления процессами.
          </li>
          <li className={style.rule__secondLevel}>
            Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет важную
            роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики лишь
            добавляют фракционных разногласий и преданы социально-демократической анафеме.
          </li>
          <li className={style.rule__secondLevel}>
            Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
            экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
          </li>
          <li className={style.rule__secondLevel}>
            Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
            политической культуры, будут объединены в целые кластеры себе подобных.
          </li>
        </ol>
      </li>
      <li className={style.rule__firstLevel}>
        С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие возможности
        для приоритизации разума над эмоциями.
        <ol>
          <li className={style.rule__secondLevel}>
            Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
            участника как способного принимать собственные решения касаемо инновационных методов управления процессами.
            <ol>
              <li className={style.rule__thirdLevel}>
                Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет
                важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней
                политики лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.
              </li>
              <li className={style.rule__thirdLevel}>
                Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
                экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
              </li>
            </ol>
          </li>
          <li className={style.rule__secondLevel}>
            Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
            политической культуры, будут объединены в целые кластеры себе подобных.
          </li>
        </ol>
      </li>
      <li className={style.rule__firstLevel}>
        Принимая во внимание показатели успешности, укрепление и развитие внутренней структуры требует от нас анализа
        приоритизации
        <ol>
          <li className={style.rule__secondLevel}>
            Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого
            участника как способного принимать собственные решения касаемо инновационных методов управления процессами.
            <ol>
              <li className={style.rule__thirdLevel}>
                Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет
                важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней
                политики лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.
              </li>
              <li className={style.rule__thirdLevel}>
                Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую
                экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.
              </li>
            </ol>
          </li>
          <li className={style.rule__secondLevel}>
            Но независимые государства, которые представляют собой яркий пример континентально-европейского типа
            политической культуры, будут объединены в целые кластеры себе подобных.
          </li>
          <li className={style.rule__secondLevel}>
            Не следует, однако, забывать, что экономическая повестка сегодняшнего дня требует анализа анализа
            существующих паттернов поведения.
            <ol>
              <li className={style.rule__thirdLevel}>
                А ещё представители современных социальных резервов набирают популярность среди определенных слоев
                населения, а значит, должны быть функционально разнесены на независимые элементы.
                <ol>
                  <li className={style.rule__fourthLevel}>
                    Стремящиеся вытеснить традиционное производство, нанотехнологии могут быть объявлены нарушающими
                    общечеловеческие нормы этики и морали.
                  </li>
                  <li className={style.rule__fourthLevel}>
                    Прежде всего, разбавленное изрядной долей эмпатии, рациональное мышление однозначно фиксирует
                    необходимость новых предложений. Являясь всего лишь частью общей картины, независимые государства
                    представлены в исключительно положительном свете.
                  </li>
                </ol>
              </li>
            </ol>
          </li>
          <li className={style.rule__secondLevel}>
            Повседневная практика показывает, что убеждённость некоторых оппонентов требует от нас анализа распределения
            внутренних резервов и ресурсов.
          </li>
        </ol>
      </li>
    </ol>
  </section>
);
